Repository: J3ffar/Qader
Catalog: qader_backend/apps/chat/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Only students can access this view.
ar: الطلاب فقط يمكنهم الوصول إلى هذا العرض.

source: No mentor assigned. Conversation not available.
ar: لم يتم تعيين مرشد. المحادثة غير متاحة.

source: Access denied for this conversation.
ar: تم رفض الوصول لهذه المحادثة.

source: Conversation ID not provided.
ar: لم يتم توفير معرف المحادثة.

source: You are not a participant in this conversation.
ar: أنت لست مشاركًا في هذه المحادثة.

source: Only teachers or trainers can list their conversations.
ar: المعلمون أو المدربون فقط يمكنهم عرض محادثاتهم.

source: {updated_count} messages marked as read.
ar: تم وضع علامة مقروء على {updated_count} رسالة.

source: Student Profile
ar: ملف الطالب الشخصي

source: Teacher/Trainer Profile
ar: ملف المعلم/المدرب الشخصي

source: Created At
ar: تاريخ الإنشاء

source: Last Message At
ar: آخر رسالة في

source: Conversation
ar: المحادثة

source: Conversations
ar: المحادثات

source: The 'student' must have the role of STUDENT.
ar: يجب أن يكون لدى 'الطالب' دور طالب.

source: The 'teacher' must have the role of TEACHER or TRAINER.
ar: يجب أن يكون لدى 'المعلم' دور معلم أو مدرب.

source: Sender
ar: المرسل

source: Content
ar: المحتوى

source: Timestamp
ar: الختم الزمني

source: Is Read?
ar: هل تمت القراءة؟

source: Message
ar: الرسالة

source: Messages
ar: الرسائل

source: Sender must be a participant in the conversation.
ar: يجب أن يكون المرسل مشاركًا في المحادثة.
