Repository: J3ffar/Qader
Catalog: qader_backend/apps/community/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Post Type
ar: نوع المنشور

source: Section Slug
ar: سلاغ القسم

source: Tags (comma-separated names/slugs)
ar: الوسوم (أسماء/سلاغات مفصولة بفواصل)

source: Is Pinned?
ar: هل هو مثبت؟

source: User's Name or Username
ar: اسم المستخدم أو اسم المستخدم

source: ID of the parent reply being responded to (for threading).
ar: معرف الرد الأصلي الذي يتم الرد عليه (للترابط).

source: Parent reply not found.
ar: لم يتم العثور على الرد الأصلي.

source: Slug of the learning section to associate this post with (optional).
ar: سلاغ قسم التعلم لربط هذا المنشور به (اختياري).

source: Invalid post type selected.
ar: تم تحديد نوع منشور غير صالح.

source: A title is required for this post type.
ar: العنوان مطلوب لهذا النوع من المنشورات.

source: Recipient User ID
ar: معرف المستخدم المستلم

source: You cannot send a partner request to yourself.
ar: لا يمكنك إرسال طلب شراكة لنفسك.

source: You already have a pending request with this user.
ar: لديك بالفعل طلب معلق مع هذا المستخدم.

source: You are already partners with this user.
ar: أنت بالفعل شريك مع هذا المستخدم.

source: Parent reply does not belong to this post.
ar: الرد الأصلي لا ينتمي إلى هذا المنشور.

source: sent you a study partner request
ar: أرسل لك طلب شراكة دراسية

source: accepted your study partner request
ar: قبل طلب شراكتك الدراسية

source: Study Discussion
ar: مناقشة دراسية

source: Achievement
ar: إنجاز

source: Find Study Partners
ar: البحث عن شركاء دراسة

source: Tips & Experiences
ar: نصائح وتجارب

source: Monthly Competition
ar: مسابقة شهرية

source: Author
ar: المؤلف

source: The user who created this post.
ar: المستخدم الذي أنشأ هذا المنشور.

source: The category or purpose of the post.
ar: فئة المنشور أو الغرض منه.

source: Section Filter
ar: تصفية حسب القسم

source: Optional filter by main learning section (e.g., Quant, Verbal)
ar: تصفية اختيارية حسب قسم التعلم الرئيسي (مثل الكمي، اللفظي)

source: Title
ar: العنوان

source: Optional title for the post.
ar: عنوان اختياري للمنشور.

source: Content
ar: المحتوى

source: The main body of the post.
ar: النص الرئيسي للمنشور.

source: Image
ar: صورة

source: Is Pinned
ar: مثبت

source: Pinned posts appear at the top (Admin/Moderator action).
ar: المنشورات المثبتة تظهر في الأعلى (إجراء المسؤول/المشرف).

source: Is Closed
ar: مغلق

source: Prevents further replies (Admin/Moderator action).
ar: يمنع الردود الإضافية (إجراء المسؤول/المشرف).

source: Tags
ar: الوسوم

source: Relevant keywords or topics for the post.
ar: كلمات مفتاحية أو مواضيع ذات صلة بالمنشور.

source: Likes
ar: الإعجابات

source: Created At
ar: تاريخ الإنشاء

source: Updated At
ar: تاريخ التحديث

source: Community Post
ar: منشور مجتمع

source: Community Posts
ar: منشورات المجتمع

source: Post
ar: المنشور

source: The post this reply belongs to.
ar: المنشور الذي ينتمي إليه هذا الرد.

source: The user who wrote this reply.
ar: المستخدم الذي كتب هذا الرد.

source: The body of the reply.
ar: نص الرد.

source: Parent Reply
ar: الرد الأصلي

source: Links to the reply being responded to for threading.
ar: روابط إلى الرد الذي يتم الرد عليه للترابط.

source: Community Reply
ar: رد مجتمع

source: Community Replies
ar: ردود المجتمع

source: Pending
ar: معلق

source: Accepted
ar: مقبول

source: Rejected
ar: مرفوض

source: Sender
ar: المرسل

source: Recipient
ar: المستلم

source: Status
ar: الحالة

source: Partner Request
ar: طلب شراكة

source: Partner Requests
ar: طلبات الشراكة
