Repository: J3ffar/Qader
Catalog: qader_backend/apps/gamification/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Icon
ar: أيقونة

source: Status
ar: الحالة

source: Description Snippet
ar: مقتطف الوصف

source: Visuals & Assets
ar: المرئيات والأصول

source: User's current point balance.
ar: رصيد نقاط المستخدم الحالي.

source: Number of consecutive study days.
ar: عدد أيام الدراسة المتتالية.

source: User's longest ever study streak.
ar: أطول سلسلة دراسة للمستخدم على الإطلاق.

source: Whether the current authenticated user has earned this badge.
ar: ما إذا كان المستخدم الحالي المصادق عليه قد حصل على هذه الشارة.

source: Timestamp when the current user earned this badge (null if not earned).
ar: الختم الزمني عندما حصل المستخدم الحالي على هذه الشارة (null إذا لم يتم الحصول عليها).

source: URL of the badge icon image.
ar: رابط صورة أيقونة الشارة.

source: Details of the earned badge.
ar: تفاصيل الشارة المكتسبة.

source: Timestamp when the user earned this badge.
ar: الختم الزمني عندما حصل المستخدم على هذه الشارة.

source: Purchase successful!
ar: تم الشراء بنجاح!

source: User profile not found.
ar: لم يتم العثور على ملف المستخدم الشخصي.

source: Reward item not found or is inactive.
ar: لم يتم العثور على عنصر المكافأة أو أنه غير نشط.

source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Gamification
ar: التلعيب

source: Question Solved
ar: تم حل السؤال

source: Test Completed
ar: تم الانتهاء من الاختبار

source: Level Assessment Completed
ar: تم الانتهاء من تقييم المستوى

source: Streak Bonus
ar: مكافأة السلسلة

source: Feature First Use
ar: أول استخدام للميزة

source: Challenge Participation
ar: مشاركة في التحدي

source: Challenge Win
ar: فوز في التحدي

source: Reward Purchase
ar: شراء مكافأة

source: Admin Adjustment
ar: تعديل المسؤول

source: Referral Bonus
ar: مكافأة الإحالة

source: Badge Earned
ar: تم الحصول على شارة

source: Other
ar: أخرى

source: User
ar: المستخدم

source: Points Change
ar: تغيير النقاط

source: Reason Code
ar: رمز السبب

source: Standardized code indicating the reason for the point change.
ar: رمز موحد يشير إلى سبب تغيير النقاط.

source: Description
ar: الوصف

source: Human-readable explanation, especially for OTHER or specific contexts.
ar: شرح سهل القراءة، خاصة للسياقات الأخرى أو المحددة.

source: Related Object Type
ar: نوع الكائن المرتبط

source: Related Object ID
ar: معرف الكائن المرتبط

source: Timestamp
ar: الختم الزمني

source: Point Log
ar: سجل النقاط

source: Point Logs
ar: سجلات النقاط

source: Consecutive Study Days
ar: أيام الدراسة المتتالية

source: Correct Questions Solved
ar: الأسئلة الصحيحة التي تم حلها

source: Tests Completed (Any Type)
ar: الاختبارات المكتملة (أي نوع)

source: Challenges Won
ar: التحديات التي تم الفوز بها

source: Other / Manual Award
ar: أخرى / مكافأة يدوية

source: Name
ar: الاسم

source: Slug
ar: سلاغ

source: Unique identifier used internally and potentially in URLs.
ar: معرف فريد يستخدم داخليًا وربما في عناوين URL.

source: Icon Image
ar: صورة الأيقونة

source: Upload an image file for the badge icon.
ar: تحميل ملف صورة لأيقونة الشارة.

source: Criteria Description
ar: وصف المعيار

source: User-facing text explaining how to earn the badge.
ar: نص يظهر للمستخدم يشرح كيفية الحصول على الشارة.

source: Criteria Type
ar: نوع المعيار

source: The type of condition required to earn this badge.
ar: نوع الشرط المطلوب للحصول على هذه الشارة.

source: Target Value
ar: القيمة المستهدفة

source: The numerical goal for the criteria (e.g., 5 for a 5-day streak, 50 for 50 questions). Not used for 'Other' type.
ar: الهدف الرقمي للمعيار (مثل 5 لسلسلة 5 أيام، 50 لـ 50 سؤال). لا يستخدم لنوع 'أخرى'.

source: Is Active
ar: هل هو نشط؟

source: Inactive badges cannot be earned.
ar: لا يمكن الحصول على الشارات غير النشطة.

source: Badge
ar: شارة

source: Badges
ar: شارات

source: No icon
ar: لا توجد أيقونة

source: Earned At
ar: تاريخ الحصول عليها

source: User Badge
ar: شارة المستخدم

source: User Badges
ar: شارات المستخدم

source: Avatar/Theme
ar: صورة رمزية/سمة

source: Study Material/Outline
ar: مادة دراسية/مخطط تفصيلي

source: Competition Entry
ar: دخول مسابقة

source: Item Type
ar: نوع العنصر

source: Cost (Points)
ar: التكلفة (نقاط)

source: Item Image
ar: صورة العنصر

source: Optional visual representation of the reward item.
ar: تمثيل مرئي اختياري لعنصر المكافأة.

source: Asset File
ar: ملف الأصل

source: Optional downloadable file associated with the reward (e.g., PDF outline).
ar: ملف اختياري قابل للتنزيل مرتبط بالمكافأة (مثل مخطط تفصيلي بصيغة PDF).

source: Reward Store Item
ar: عنصر متجر المكافآت

source: Reward Store Items
ar: عناصر متجر المكافآت

source: No image
ar: لا توجد صورة

source: Item
ar: العنصر

source: Points Spent
ar: النقاط المصروفة

source: Purchased At
ar: تاريخ الشراء

source: User Reward Purchase
ar: شراء مكافأة المستخدم

source: User Reward Purchases
ar: مشتريات مكافآت المستخدم

source: Study Date
ar: تاريخ الدراسة

source: The calendar date (UTC) of the study activity.
ar: التاريخ التقويمي (UTC) لنشاط الدراسة.

source: Logged At
ar: تاريخ التسجيل

source: Study Day Log
ar: سجل يوم الدراسة

source: Study Day Logs
ar: سجلات أيام الدراسة

source: Reached {days}-day streak!
ar: وصلت إلى سلسلة {days} أيام!

source: Completed Test Attempt #{att_id} ({type})
ar: تم الانتهاء من محاولة الاختبار رقم {att_id} ({type})

source: Completed Level Assessment #{att_id}
ar: تم الانتهاء من تقييم المستوى رقم {att_id}

source: Invalid user for reward purchase.
ar: مستخدم غير صالح لشراء المكافأة.

source: Insufficient points to purchase this item.
ar: نقاط غير كافية لشراء هذا العنصر.

source: Failed to update points balance during purchase.
ar: فشل تحديث رصيد النقاط أثناء الشراء.

source: User profile error during purchase.
ar: خطأ في ملف المستخدم الشخصي أثناء الشراء.

source: An unexpected error occurred during purchase.
ar: حدث خطأ غير متوقع أثناء الشراء.

source: Solved Question #{qid} ({mode})
ar: تم حل السؤال رقم {qid} ({mode})
