Repository: J3ffar/Qader
Catalog: qader_backend/apps/notifications/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Core Info
ar: المعلومات الأساسية

source: Status
ar: الحالة

source: Related Objects (Readonly)
ar: الكائنات ذات الصلة (للقراءة فقط)

source: Timestamps
ar: الطوابع الزمنية

source: Recipient
ar: المستلم

source: Actor
ar: الفاعل

source: Created At
ar: تاريخ الإنشاء

source: Target
ar: الهدف

source: Target (Admin Link)
ar: الهدف (رابط المسؤول)

source: Action Object (Admin Link)
ar: كائن الإجراء (رابط المسؤول)

source: A list of notification IDs to mark as read.
ar: قائمة بمعرفات الإشعارات لتمييزها كمقروءة.

source: One or more notification IDs are invalid or do not belong to the current user.
ar: معرف إشعار واحد أو أكثر غير صالح أو لا ينتمي إلى المستخدم الحالي.

source: {updated_count} notification(s) marked as read.
ar: تم وضع علامة مقروء على {updated_count} إشعار(ات).

source: {updated_count} unread notification(s) marked as read.
ar: تم وضع علامة مقروء على {updated_count} إشعار(ات) غير مقروءة.

source: Notifications
ar: الإشعارات

source: Information
ar: معلومات

source: Success
ar: نجاح

source: Warning
ar: تحذير

source: Error
ar: خطأ

source: System Update
ar: تحديث النظام

source: User Profile Update
ar: تحديث ملف تعريف المستخدم

source: Subscription Update
ar: تحديث الاشتراك

source: Badge Earned
ar: تم كسب شارة

source: Community Post Interaction
ar: تفاعل منشور المجتمع

source: Community Reply Interaction
ar: تفاعل رد المجتمع

source: Challenge Invitation
ar: دعوة تحدي

source: Challenge Update
ar: تحديث التحدي

source: Mentor Assignment
ar: تعيين مرشد

source: Support Ticket Update
ar: تحديث تذكرة الدعم

source: Verb
ar: الفعل

source: A short description of the action, e.g., 'liked your post', 'earned a new badge'.
ar: وصف موجز للإجراء، على سبيل المثال، 'أعجب بمنشورك'، 'كسب شارة جديدة'.

source: Description
ar: الوصف

source: Optional: More detailed text for the notification. Can include simple HTML if rendered carefully.
ar: اختياري: نص أكثر تفصيلاً للإشعار. يمكن أن يتضمن HTML بسيطًا إذا تم عرضه بعناية.

source: Target Object ID
ar: معرف كائن الهدف

source: Action Object ID
ar: معرف كائن الإجراء

source: Notification Type
ar: نوع الإشعار

source: Is Read?
ar: هل تمت القراءة؟

source: Read At
ar: تاريخ القراءة

source: URL
ar: عنوان URL

source: Additional Data
ar: بيانات إضافية

source: Notification
ar: إشعار

source: your subscription is expiring soon
ar: اشتراكك سينتهي قريباً

source: Heads up! Your Qader subscription will expire in {days} day(s) on {expiry_date}. Renew now to maintain access.
ar: انتبه! اشتراكك في قادر سينتهي خلال {days} يوم(أيام) في {expiry_date}. جدد الآن للحفاظ على الوصول.
