Repository: J3ffar/Qader
Catalog: qader_backend/apps/users/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Profile
ar: الملف الشخصي

source: Qiyas History
ar: سجل القياس

source: Subscription
ar: الاشتراك

source: Gamification & Progress
ar: التلعيب والتقدم

source: Learning Levels
ar: مستويات التعلم

source: Referral
ar: الإحالة

source: Settings
ar: الإعدادات

source: Role
ar: الدور

source: No Profile
ar: لا يوجد ملف شخصي

source: Account Type
ar: نوع الحساب

source: Usage Information
ar: معلومات الاستخدام

source: Metadata
ar: البيانات الوصفية

source: Used By
ar: مستخدم بواسطة

source: Created By
ar: مُنشأ بواسطة

source: You must have an active subscription to perform this action.
ar: يجب أن يكون لديك اشتراك نشط لتنفيذ هذا الإجراء.

source: Identity
ar: الهوية

source: Password
ar: كلمة المرور

source: No active account found with the given credentials.
ar: لم يتم العثور على حساب نشط بالبيانات المقدمة.

source: Custom Subscription
ar: اشتراك مخصص

source: Confirm Password
ar: تأكيد كلمة المرور

source: This email address is pending confirmation or already registered.
ar: عنوان البريد الإلكتروني هذا بانتظار التأكيد أو مسجل بالفعل.

source: A user with this email already exists.
ar: مستخدم بهذا البريد الإلكتروني موجود بالفعل.

source: Password fields didn't match.
ar: حقلي كلمة المرور غير متطابقين.

source: Could not generate a suitable username. Please try a different full name or contact support.
ar: تعذر إنشاء اسم مستخدم مناسب. يرجى تجربة اسم كامل مختلف أو الاتصال بالدعم.

source: We encountered an issue creating your username. Please try a slightly different full name or try again later.
ar: واجهنا مشكلة في إنشاء اسم المستخدم الخاص بك. يرجى تجربة اسم كامل مختلف قليلاً أو المحاولة لاحقًا.

source: This email address is already registered.
ar: عنوان البريد الإلكتروني هذا مسجل بالفعل.

source: Signup failed due to a data conflict. Please try again.
ar: فشل التسجيل بسبب تعارض في البيانات. يرجى المحاولة مرة أخرى.

source: An unexpected error occurred during signup. Please try again later.
ar: حدث خطأ غير متوقع أثناء التسجيل. يرجى المحاولة لاحقًا.

source: Optional: Enter a serial code to activate a paid subscription.
ar: اختياري: أدخل رمز تسلسلي لتفعيل اشتراك مدفوع.

source: This username is already taken. Please choose another one.
ar: اسم المستخدم هذا مستخدم بالفعل. يرجى اختيار اسم آخر.

source: This field is required to complete your profile.
ar: هذا الحقل مطلوب لاستكمال ملفك الشخصي.

source: Invalid or already used serial code.
ar: رمز تسلسلي غير صالح أو مستخدم بالفعل.

source: Error validating serial code.
ar: خطأ في التحقق من صحة الرمز التسلسلي.

source: You cannot use your own referral code.
ar: لا يمكنك استخدام رمز الإحالة الخاص بك.

source: Invalid referral code provided.
ar: تم توفير رمز إحالة غير صالح.

source: Error validating referral code.
ar: خطأ في التحقق من صحة رمز الإحالة.

source: Image size cannot exceed {size}MB.
ar: حجم الصورة لا يمكن أن يتجاوز {size} ميجابايت.

source: Auto dark mode start time must be before end time.
ar: وقت بدء الوضع الداكن التلقائي يجب أن يكون قبل وقت الانتهاء.

source: Auto dark mode end time must be after start time.
ar: وقت انتهاء الوضع الداكن التلقائي يجب أن يكون بعد وقت البدء.

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Incorrect current password.
ar: كلمة المرور الحالية غير صحيحة.

source: New password fields didn't match.
ar: حقلي كلمة المرور الجديدة غير متطابقين.

source: New password cannot be the same as the current password.
ar: كلمة المرور الجديدة لا يمكن أن تكون نفس كلمة المرور الحالية.

source: Email or Username
ar: البريد الإلكتروني أو اسم المستخدم

source: An error occurred while validating the identifier.
ar: حدث خطأ أثناء التحقق من صحة المعرّف.

source: The email address or username used to request the OTP.
ar: عنوان البريد الإلكتروني أو اسم المستخدم المستخدم لطلب رمز التحقق لمرة واحدة (OTP).

source: OTP Code
ar: رمز التحقق لمرة واحدة (OTP)

source: The {otp_length}-digit OTP sent to your email.
ar: رمز التحقق لمرة واحدة (OTP) المكون من {otp_length} أرقام المرسل إلى بريدك الإلكتروني.

source: User account is inactive.
ar: حساب المستخدم غير نشط.

source: User with this identifier not found.
ar: لم يتم العثور على مستخدم بهذا المعرّف.

source: Error identifying user account.
ar: خطأ في تحديد حساب المستخدم.

source: The OTP provided is invalid or has expired.
ar: رمز التحقق لمرة واحدة (OTP) المقدم غير صالح أو انتهت صلاحيته.

source: No active OTP found for this user or it has expired. Please request a new one.
ar: لم يتم العثور على رمز تحقق لمرة واحدة (OTP) نشط لهذا المستخدم أو انتهت صلاحيته. يرجى طلب رمز جديد.

source: An error occurred during OTP verification.
ar: حدث خطأ أثناء التحقق من رمز التحقق لمرة واحدة (OTP).

source: Reset Token
ar: رمز إعادة التعيين

source: The secure token received after OTP verification.
ar: الرمز الآمن الذي تم استلامه بعد التحقق من رمز التحقق لمرة واحدة (OTP).

source: Invalid or expired reset token. Please verify OTP again.
ar: رمز إعادة التعيين غير صالح أو منتهي الصلاحية. يرجى التحقق من رمز التحقق لمرة واحدة (OTP) مرة أخرى.

source: An error occurred while validating the reset token.
ar: حدث خطأ أثناء التحقق من صحة رمز إعادة التعيين.

source: Serial Code
ar: الرمز التسلسلي

source: The new serial code to activate or extend subscription.
ar: الرمز التسلسلي الجديد لتفعيل أو تمديد الاشتراك.

source: Plan Type
ar: نوع الخطة

source: Redeemed On
ar: تم الاسترداد في

source: Duration (Days)
ar: المدة (أيام)

source: Refresh token is required.
ar: رمز التحديث مطلوب.

source: Invalid refresh token or error during logout.
ar: رمز التحديث غير صالح أو حدث خطأ أثناء تسجيل الخروج.

source: Confirmation email sent. Please check your inbox.
ar: تم إرسال بريد إلكتروني للتأكيد. يرجى التحقق من صندوق الوارد الخاص بك.

source: Account created but failed to send confirmation email. Please contact support.
ar: تم إنشاء الحساب ولكن فشل إرسال بريد إلكتروني للتأكيد. يرجى التواصل مع الدعم.

source: An unexpected error occurred during registration.
ar: حدث خطأ غير متوقع أثناء التسجيل.

source: Invalid confirmation link.
ar: رابط التأكيد غير صالح.

source: Invalid or expired confirmation link.
ar: رابط التأكيد غير صالح أو منتهي الصلاحية.

source: Profile is already complete.
ar: الملف الشخصي مكتمل بالفعل.

source: User profile not found.
ar: لم يتم العثور على ملف المستخدم الشخصي.

source: This username has just been taken. Please try another.
ar: اسم المستخدم هذا تم أخذه للتو. يرجى تجربة اسم آخر.

source: Failed to process serial code. Please try again.
ar: فشل معالجة الرمز التسلسلي. يرجى المحاولة مرة أخرى.

source: Serial code became invalid during processing.
ar: أصبح الرمز التسلسلي غير صالح أثناء المعالجة.

source: completed your profile
ar: أكمل ملفك الشخصي

source: Your profile is now complete! You can start exploring.
ar: ملفك الشخصي مكتمل الآن! يمكنك البدء في الاستكشاف.

source: An error occurred while completing the profile.
ar: حدث خطأ أثناء إكمال الملف الشخصي.

source: Password updated successfully.
ar: تم تحديث كلمة المرور بنجاح.

source: If your account exists and is active, an OTP has been sent to your email address.
ar: إذا كان حسابك موجودًا ونشطًا، فقد تم إرسال OTP إلى عنوان بريدك الإلكتروني.

source: We encountered an issue sending the OTP. Please try again later or contact support.
ar: واجهنا مشكلة في إرسال كلمة المرور لمرة واحدة (OTP). يُرجى المحاولة لاحقًا أو التواصل مع فريق الدعم.

source: An unexpected error occurred. Please try again later or contact support.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بالدعم.

source: OTP verified successfully. Please use the provided token to reset your password.
ar: تم التحقق من رمز OTP بنجاح. يرجى استخدام الرمز المقدم لإعادة تعيين كلمة المرور الخاصة بك.

source: An unexpected error occurred during OTP verification.
ar: حدث خطأ غير متوقع أثناء التحقق من رمز التحقق لمرة واحدة (OTP).

source: Password has been reset successfully.
ar: تمت إعادة تعيين كلمة المرور بنجاح.

source: An unexpected error occurred while resetting your password. Please try again.
ar: حدث خطأ غير متوقع أثناء إعادة تعيين كلمة المرور. يرجى المحاولة مرة أخرى.

source: Invalid or expired password reset link.
ar: رابط إعادة تعيين كلمة المرور غير صالح أو منتهي الصلاحية.

source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Serial code became invalid or used before application could complete.
ar: أصبح الرمز التسلسلي غير صالح أو مستخدم قبل إكمال التطبيق.

source: An error occurred while applying the serial code.
ar: حدث خطأ أثناء تطبيق الرمز التسلسلي.

source: No active subscription to cancel.
ar: لا يوجد اشتراك نشط للإلغاء.

source: Subscription cancelled successfully.
ar: تم إلغاء الاشتراك بنجاح.

source: An error occurred while cancelling the subscription.
ar: حدث خطأ أثناء إلغاء الاشتراك.

source: Users
ar: المستخدمون

source: Free Trial
ar: تجربة مجانية

source: Subscribed
ar: مشترك

source: Permanent Access
ar: وصول دائم

source: 1 Month
ar: شهر واحد

source: 3 Months
ar: 3 أشهر

source: 12 Months
ar: 12 شهرًا

source: Custom Duration
ar: مدة مخصصة

source: 1 Month Access
ar: وصول لمدة شهر واحد

source: Full access to all platform features for 30 days.
ar: وصول كامل لجميع ميزات المنصة لمدة 30 يومًا.

source: 3 Months Access
ar: وصول لمدة 3 أشهر

source: Full access to all platform features for 91 days (approx. 3 months).
ar: وصول كامل لجميع ميزات المنصة لمدة 91 يومًا (تقريبًا 3 أشهر).

source: 12 Months Access
ar: وصول لمدة 12 شهرًا

source: Full access to all platform features for 365 days (1 year).
ar: وصول كامل لجميع ميزات المنصة لمدة 365 يومًا (عام واحد).

source: Subscription duration determined by the specific serial code.
ar: مدة الاشتراك تحدد بواسطة الرمز التسلسلي المحدد.

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Student
ar: طالب

source: Teacher
ar: معلم

source: Trainer
ar: مدرب

source: Admin
ar: مسؤول

source: Sub-Admin
ar: مسؤول فرعي

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System
ar: النظام

source: Code
ar: الرمز

source: The unique serial code string (case-insensitive).
ar: سلسلة الرمز التسلسلي الفريدة (لا حساسة لحالة الأحرف).

source: Subscription Type
ar: نوع الاشتراك

source: Categorizes the intended duration or type of the code.
ar: يصنف المدة أو النوع المقصود للرمز.

source: Subscription length in days granted by this code. Used for calculating expiry.
ar: مدة الاشتراك بالأيام الممنوحة بواسطة هذا الرمز. تستخدم لحساب تاريخ الانتهاء.

source: Is Active?
ar: هل هو نشط؟

source: Indicates if the code can currently be used for redemption.
ar: يشير إلى ما إذا كان يمكن استخدام الرمز حاليًا للاسترداد.

source: Is Used?
ar: هل تم استخدامه؟

source: Indicates if the code has already been redeemed.
ar: يشير إلى ما إذا كان الرمز قد تم استرداده بالفعل.

source: The user who redeemed this code.
ar: المستخدم الذي قام باسترداد هذا الرمز.

source: Used At
ar: تم استخدامه في

source: Timestamp when the code was redeemed.
ar: الختم الزمني عندما تم استرداد الرمز.

source: Admin or Sub-Admin who generated the code.
ar: المسؤول أو المسؤول الفرعي الذي أنشأ الرمز.

source: Notes
ar: ملاحظات

source: Administrative notes (e.g., batch identifier, purpose).
ar: ملاحظات إدارية (مثل معرف الدفعة، الغرض).

source: Created At
ar: تاريخ الإنشاء

source: Updated At
ar: تاريخ التحديث

source: Serial Codes
ar: الأكواد التسلسلية

source: User
ar: المستخدم

source: OTP Code (Hashed)
ar: رمز OTP (Hashed)

source: Hashed version of the OTP code.
ar: النسخة المشفرة من رمز التحقق لمرة واحدة (OTP).

source: OTP Created At
ar: تاريخ إنشاء OTP

source: OTP Expires At
ar: ينتهي رمز التحقق لمرة واحدة (OTP) في

source: Reset Token (Hashed)
ar: رمز إعادة التعيين (مشفر)

source: Reset Token Expires At
ar: ينتهي رمز إعادة التعيين في

source: True if password has been successfully reset using this record.
ar: صحيح إذا تم إعادة تعيين كلمة المرور بنجاح باستخدام هذا السجل.

source: Password Reset OTP & Token
ar: رمز التحقق لمرة واحدة (OTP) ورمز إعادة تعيين كلمة المرور

source: Password Reset OTPs & Tokens
ar: رموز التحقق لمرة واحدة (OTP) ورموز إعادة تعيين كلمة المرور

source: Full Name
ar: الاسم الكامل

source: User's full legal name.
ar: اسم المستخدم القانوني الكامل.

source: Preferred Name
ar: الاسم المفضل

source: How the user prefers to be called.
ar: كيف يفضل المستخدم أن يُنادى.

source: Gender
ar: الجنس

source: Grade/Level
ar: الصف/المستوى

source: Educational level (e.g., Grade 12, University Freshman).
ar: المستوى التعليمي (مثل الصف الثاني عشر، طالب جامعي جديد).

source: Taken Qiyas Before?
ar: هل سبق لك أخذ اختبار قياس؟

source: Has the student taken an official Qiyas test previously?
ar: هل سبق للطالب أن أخذ اختبار قياس رسمي من قبل؟

source: Profile Picture
ar: صورة الملف الشخصي

source: Indicates the user's current subscription level (e.g., Free Trial, Subscribed).
ar: يشير إلى مستوى اشتراك المستخدم الحالي (مثل تجربة مجانية، مشترك).

source: Subscription Expires At
ar: ينتهي الاشتراك في

source: Last Redeemed Serial Code
ar: آخر رمز تسلسلي تم استرداده

source: The last serial code used to activate/extend subscription.
ar: آخر رمز تسلسلي تم استخدامه لتفعيل/تمديد الاشتراك.

source: Points
ar: النقاط

source: Current Study Streak (Days)
ar: سلسلة الدراسة الحالية (أيام)

source: Longest Study Streak (Days)
ar: أطول سلسلة دراسة (أيام)

source: Preferred Language
ar: اللغة المفضلة

source: User's preferred language for emails and interface elements.
ar: لغة المستخدم المفضلة للرسائل الإلكترونية وعناصر الواجهة.

source: Last Study Activity At
ar: آخر نشاط دراسي في

source: Timestamp of the last tracked study action for streak calculation.
ar: الختم الزمني لآخر إجراء دراسة تم تتبعه لحساب السلسلة.

source: Current Verbal Level (%)
ar: المستوى اللفظي الحالي (%)

source: Assessed proficiency level (0-100) in the Verbal section.
ar: مستوى الكفاءة المقدر (0-100) في القسم اللفظي.

source: Current Quantitative Level (%)
ar: المستوى الكمي الحالي (%)

source: Assessed proficiency level (0-100) in the Quantitative section.
ar: مستوى الكفاءة المقدر (0-100) في القسم الكمي.

source: Last Visited Study Option Slug
ar: سلاغ آخر خيار دراسة تم زيارته

source: Slug identifier of the last viewed section in 'Study Page'.
ar: معرف السلاغ لآخر قسم تم عرضه في 'صفحة الدراسة'.

source: Dark Mode Preference
ar: تفضيل الوضع الداكن

source: Auto Dark Mode Enabled?
ar: تمكين الوضع الداكن التلقائي؟

source: Auto Dark Mode Start Time
ar: وقت بدء الوضع الداكن التلقائي

source: Auto Dark Mode End Time
ar: وقت انتهاء الوضع الداكن التلقائي

source: Reminders Enabled?
ar: تمكين التذكيرات؟

source: Upcoming Test Date
ar: تاريخ الاختبار القادم

source: User-set date for their upcoming official test.
ar: التاريخ الذي يحدده المستخدم لاختباره الرسمي القادم.

source: Study Reminder Time
ar: وقت تذكير الدراسة

source: Preferred time of day for study reminders (HH:MM).
ar: الوقت المفضل من اليوم لتذكيرات الدراسة (HH:MM).

source: Referral Code
ar: رمز الإحالة

source: User's unique code to share for referrals.
ar: رمز المستخدم الفريد للمشاركة للإحالات.

source: Referred By User
ar: تمت الإحالة بواسطة المستخدم

source: The user whose referral code this user signed up with.
ar: المستخدم الذي استخدم رمز الإحالة الخاص به هذا المستخدم للتسجيل.

source: Admin Permissions
ar: صلاحيات المسؤول

source: Specific permissions granted to this sub-admin user.
ar: صلاحيات محددة ممنوحة لهذا المستخدم المسؤول الفرعي.

source: Assigned Mentor (Teacher/Trainer)
ar: الموجه المعين (معلم/مدرب)

source: The Teacher or Trainer assigned to this student. Only applicable if role is Student.
ar: المعلم أو المدرب المعين لهذا الطالب. ينطبق فقط إذا كان الدور طالبًا.

source: Profile Created At
ar: تاريخ إنشاء الملف الشخصي

source: Profile Updated At
ar: تاريخ تحديث الملف الشخصي

source: User Profile
ar: ملف المستخدم الشخصي

source: User Profiles
ar: ملفات المستخدمين الشخصية

source: activated a subscription
ar: تم تفعيل الاشتراك

source: Your subscription has been successfully activated using code: {serial_code}.
ar: تم تفعيل اشتراكك بنجاح باستخدام الرمز: {serial_code}.

source: You have reached your limit for asking AI questions today.
ar: لقد وصلت إلى الحد الأقصى لعدد الأسئلة التي يمكنك طرحها على الذكاء الاصطناعي اليوم.
