Repository: J3ffar/Qader
Catalog: qader_backend/apps/admin_panel/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Invalid status value.
ar: قيمة حالة غير صالحة.

source: Subscription Plan Type
ar: نوع خطة الاشتراك

source: Select the plan type (e.g., 1 Month, 3 Months) for the codes. 'Custom' type cannot be batch generated here.
ar: حدد نوع الخطة (مثل شهر واحد، 3 أشهر) للأكواد. لا يمكن إنشاء نوع 'مخصص' دفعة واحدة هنا.

source: Number of Codes
ar: عدد الأكواد

source: How many codes to generate in this batch (1-1000).
ar: عدد الأكواد المراد إنشاؤها في هذه الدفعة (1-1000).

source: Batch Notes
ar: ملاحظات الدفعة

source: Optional notes for this batch (e.g., 'For School X Campaign').
ar: ملاحظات اختيارية لهذه الدفعة (مثل 'لحملة المدرسة س').

source: Generating 'Custom' type codes via this batch endpoint is not supported. Use the standard POST method to create individual custom codes.
ar: إنشاء أكواد من نوع 'مخصص' عبر نقطة النهاية هذه غير مدعوم. استخدم طريقة POST القياسية لإنشاء أكواد مخصصة فردية.

source: Invalid plan type selected or configuration missing.
ar: نوع الخطة المحدد غير صالح أو التكوين مفقود.

source: Selected plan type configuration is missing 'duration_days'.
ar: تكوين نوع الخطة المحدد يفتقد 'duration_days'.

source: The unique serial code string (case-insensitive). Will be uppercased.
ar: سلسلة الرمز التسلسلي الفريدة (غير حساسة لحالة الأحرف). سيتم تحويلها إلى أحرف كبيرة.

source: A serial code with this value already exists.
ar: رمز تسلسلي بهذه القيمة موجود بالفعل.

source: Subscription Type
ar: نوع الاشتراك

source: Duration (Days)
ar: المدة (أيام)

source: Is Active?
ar: هل هو نشط؟

source: Notes
ar: ملاحظات

source: Confirm Password
ar: تأكيد كلمة المرور

source: A user with that username already exists.
ar: مستخدم بهذا الاسم موجود بالفعل.

source: A user with that email already exists.
ar: مستخدم بهذا البريد الإلكتروني موجود بالفعل.

source: Password fields didn't match.
ar: حقلي كلمة المرور غير متطابقين.

source: Mentees can only be assigned to Teachers or Trainers.
ar: لا يمكن تعيين المتدربين إلا للمعلمين أو المدربين.

source: Permissions can only be assigned to Sub-Admins.
ar: لا يمكن تعيين الصلاحيات إلا للمسؤولين الفرعيين.

source: Failed to create user due to a data conflict (e.g., username/email).
ar: فشل إنشاء المستخدم بسبب تعارض في البيانات (مثل اسم المستخدم/البريد الإلكتروني).

source: Permissions can only be set for Sub-Admins.
ar: لا يمكن تعيين الصلاحيات إلا للمسؤولين الفرعيين.

source: A mentor can only be assigned to Students.
ar: لا يمكن تعيين المرشد إلا للطلاب.

source: User cannot be their own mentor.
ar: لا يمكن للمستخدم أن يكون مرشد نفسه.

source: Username or Email of the user to reset password for.
ar: اسم المستخدم أو البريد الإلكتروني للمستخدم المراد إعادة تعيين كلمة المرور له.

source: Number of points to add (positive) or subtract (negative).
ar: عدد النقاط المراد إضافتها (موجب) أو طرحها (سالب).

source: Reason for the point adjustment (will be logged and may be shown to user).
ar: سبب تعديل النقاط (سيتم تسجيله وقد يظهر للمستخدم).

source: Points change cannot be zero.
ar: تغيير النقاط لا يمكن أن يكون صفرًا.

source: {len(created_instances)} serial codes generated successfully for plan '{SUBSCRIPTION_PLANS_CONFIG[plan_enum_value]['name']}'.
ar: تم إنشاء {len(created_instances)} رمز تسلسلي بنجاح للخطة '{SUBSCRIPTION_PLANS_CONFIG[plan_enum_value]['name']}'.

source: A database conflict occurred during code generation. This might be due to a code collision. Please try again.
ar: حدث تعارض في قاعدة البيانات أثناء إنشاء الكود. قد يكون هذا بسبب تضارب في الكود. يرجى المحاولة مرة أخرى.

source: An unexpected error occurred during code generation.
ar: حدث خطأ غير متوقع أثناء إنشاء الكود.

source: An unexpected error occurred while generating statistics.
ar: حدث خطأ غير متوقع أثناء إنشاء الإحصائيات.

source: You do not have permission to create Admin or Sub-Admin users.
ar: ليس لديك إذن لإنشاء مستخدمين من نوع مسؤول أو مسؤول فرعي.

source: You do not have permission to edit Admin or Sub-Admin users other than yourself (if applicable).
ar: ليس لديك إذن لتعديل مستخدمين من نوع مسؤول أو مسؤول فرعي غير نفسك (إذا كان ذلك ينطبق).

source: You do not have permission to assign Admin or Sub-Admin roles.
ar: ليس لديك إذن لتعيين أدوار مسؤول أو مسؤول فرعي.

source: Only superusers can delete users.
ar: يمكن للمستخدمين الخارقين فقط حذف المستخدمين.

source: You do not have permission to reset the password for this user type.
ar: ليس لديك إذن لإعادة تعيين كلمة المرور لهذا النوع من المستخدمين.

source: Password reset email sent successfully.
ar: تم إرسال بريد إلكتروني لإعادة تعيين كلمة المرور بنجاح.

source: Failed to send password reset email.
ar: فشل إرسال بريد إلكتروني لإعادة تعيين كلمة المرور.

source: Points adjusted successfully.
ar: تم تعديل النقاط بنجاح.

source: Failed to adjust points due to an internal issue.
ar: فشل تعديل النقاط بسبب مشكلة داخلية.

source: View All Users
ar: عرض جميع المستخدمين

source: Allows viewing the list of all user accounts (students, sub-admins, etc.).
ar: يسمح بعرض قائمة بجميع حسابات المستخدمين (الطلاب، المسؤولين الفرعيين، إلخ).

source: View User Details & Progress
ar: عرض تفاصيل المستخدم والتقدم

source: Allows viewing detailed profile information, statistics, and activity logs, test history, etc. for individual users.
ar: يسمح بعرض معلومات الملف الشخصي التفصيلية، الإحصائيات، سجلات النشاط، سجل الاختبار، إلخ للمستخدمين الفرديين.

source: Create Users
ar: إنشاء مستخدمين

source: Allows creating new user accounts (e.g., Students, Teachers). Does not include creating Admins/Sub-Admins unless also a main Admin.
ar: يسمح بإنشاء حسابات مستخدمين جديدة (مثل الطلاب، المعلمين). لا يشمل إنشاء المسؤولين/المسؤولين الفرعيين ما لم يكن أيضًا مسؤولًا رئيسيًا.

source: Edit User Details
ar: تعديل تفاصيل المستخدم

source: Allows modifying basic user profile fields (name, grade, gender, etc.) and account status (active/inactive). Does NOT include role or sensitive subscription details.
ar: يسمح بتعديل حقول الملف الشخصي الأساسية للمستخدم (الاسم، الصف، الجنس، إلخ) وحالة الحساب (نشط/غير نشط). لا يشمل الدور أو تفاصيل الاشتراك الحساسة.

source: Trigger User Password Reset
ar: تشغيل إعادة تعيين كلمة مرور المستخدم

source: Allows sending a password reset email to a user.
ar: يسمح بإرسال بريد إلكتروني لإعادة تعيين كلمة المرور للمستخدم.

source: Adjust User Points
ar: تعديل نقاط المستخدم

source: Allows manually adding or subtracting points from a user's account.
ar: يسمح بإضافة أو طرح النقاط يدويًا من حساب المستخدم.

source: Manage Static Content
ar: إدارة المحتوى الثابت

source: Allows editing website static pages (Homepage components, About Us, Terms, Story).
ar: يسمح بتعديل صفحات الموقع الثابتة (مكونات الصفحة الرئيسية، من نحن، الشروط، القصة).

source: Manage FAQ Content
ar: إدارة محتوى الأسئلة الشائعة

source: Allows managing Frequently Asked Questions categories and items.
ar: يسمح بإدارة فئات وعناصر الأسئلة الشائعة.

source: Manage Success Partners
ar: إدارة شركاء النجاح

source: Allows managing Success Partner categories and related settings.
ar: يسمح بإدارة فئات شركاء النجاح والإعدادات ذات الصلة.

source: Manage Learning Content
ar: إدارة محتوى التعلم

source: Allows creating, editing, and deleting learning sections, subsections, skills, and questions.
ar: يسمح بإنشاء وتعديل وحذف أقسام التعلم، الأقسام الفرعية، المهارات، والأسئلة.

source: Manage Serial Codes
ar: إدارة الأكواد التسلسلية

source: Allows viewing, generating, and managing the status and details of subscription serial codes.
ar: يسمح بعرض وإنشاء وإدارة حالة وتفاصيل أكواد الاشتراك التسلسلية.

source: Manage Gamification Settings
ar: إدارة إعدادات التلعيب

source: Allows managing the list and properties of badges and reward store items.
ar: يسمح بإدارة قائمة وخصائص الشارات وعناصر متجر المكافآت.

source: Manage Subscription Plans
ar: إدارة خطط الاشتراك

source: Allows managing the available subscription plans and their details.
ar: يسمح بإدارة خطط الاشتراك المتاحة وتفاصيلها.

source: View Contact Us Messages
ar: عرض رسائل اتصل بنا

source: Allows viewing messages submitted via the 'Contact Us' form.
ar: يسمح بعرض الرسائل المرسلة عبر نموذج 'اتصل بنا'.

source: Reply to Contact Us Messages
ar: الرد على رسائل اتصل بنا

source: Allows sending replies to users for 'Contact Us' messages.
ar: يسمح بإرسال الردود للمستخدمين لرسائل 'اتصل بنا'.

source: View Support Tickets
ar: عرض تذاكر الدعم

source: Allows viewing all user support tickets, including message logs.
ar: يسمح بعرض جميع تذاكر دعم المستخدم، بما في ذلك سجلات الرسائل.

source: Reply to Support Tickets
ar: الرد على تذاكر الدعم

source: Allows adding replies (visible to user or internal notes) to user support tickets.
ar: يسمح بإضافة الردود (مرئية للمستخدم أو ملاحظات داخلية) لتذاكر دعم المستخدم.

source: Manage Support Tickets Workflow
ar: إدارة سير عمل تذاكر الدعم

source: Allows assigning, changing status, or prioritizing support tickets.
ar: يسمح بتعيين، تغيير حالة، أو تحديد أولوية تذاكر الدعم.

source: View Platform Statistics
ar: عرض إحصائيات المنصة

source: Allows viewing aggregated platform analytics and dashboards (user counts, overall scores, usage trends).
ar: يسمح بعرض تحليلات المنصة المجمعة ولوحات المعلومات (عدد المستخدمين، الدرجات الإجمالية، اتجاهات الاستخدام).

source: Export Data
ar: تصدير البيانات

source: Allows triggering data export tasks for reporting.
ar: يسمح بتشغيل مهام تصدير البيانات للتقارير.

source: Moderate Community
ar: إشراف المجتمع

source: Allows managing (hiding, deleting, editing) community posts and replies.
ar: يسمح بإدارة (إخفاء، حذف، تعديل) منشورات المجتمع والردود.

source: List All Resources
ar: عرض جميع الموارد

source: Allows listing all instances of any resource.
ar: يسمح بعرض جميع مثيلات أي مورد.

source: Retrieve Any Resource
ar: استرداد أي مورد

source: Allows retrieving details of any single resource.
ar: يسمح باسترداد تفاصيل أي مورد فردي.

source: Create Any Resource
ar: إنشاء أي مورد

source: Allows creating new instances of any resource.
ar: يسمح بإنشاء مثيلات جديدة لأي مورد.

source: Update Any Resource
ar: تحديث أي مورد

source: Allows updating any existing resource.
ar: يسمح بتحديث أي مورد موجود.

source: Destroy Any Resource
ar: حذف أي مورد

source: Allows deleting any resource.
ar: يسمح بحذف أي مورد.

source: Manage Users
ar: إدارة المستخدمين

source: Allows full CRUD operations on user accounts.
ar: يسمح بعمليات CRUD الكاملة على حسابات المستخدمين.

source: Manage Content
ar: إدارة المحتوى

source: Allows full CRUD operations on learning content.
ar: يسمح بعمليات CRUD الكاملة على محتوى التعلم.

source: Manage Blog
ar: إدارة المدونة

source: Allows full CRUD operations on blog posts and categories.
ar: يسمح بعمليات CRUD الكاملة على منشورات وفئات المدونة.

source: Manage Challenges
ar: إدارة التحديات

source: Allows full CRUD operations on challenges.
ar: يسمح بعمليات CRUD الكاملة على التحديات.

source: Manage Community
ar: إدارة المجتمع

source: Allows full CRUD operations on community posts and comments.
ar: يسمح بعمليات CRUD الكاملة على منشورات وتعليقات المجتمع.

source: Manage Gamification
ar: إدارة التلعيب

source: Allows full CRUD operations on gamification elements (badges, rewards).
ar: يسمح بعمليات CRUD الكاملة على عناصر التلعيب (الشارات، المكافآت).

source: Manage Notifications
ar: إدارة الإشعارات

source: Allows full CRUD operations on notifications.
ar: يسمح بعمليات CRUD الكاملة على الإشعارات.

source: Manage Support
ar: إدارة الدعم

source: Allows full CRUD operations on support tickets and messages.
ar: يسمح بعمليات CRUD الكاملة على تذاكر ورسائل الدعم.

source: Manage Settings
ar: إدارة الإعدادات

source: Allows full CRUD operations on application settings and configurations.
ar: يسمح بعمليات CRUD الكاملة على إعدادات وتكوينات التطبيق.

source: Slug
ar: سلاغ

source: Unique identifier for the permission (e.g., 'view_users', 'manage_content').
ar: معرف فريد للإذن (مثل 'view_users', 'manage_content').

source: Name
ar: الاسم

source: Human-readable name for the permission.
ar: اسم الإذن سهل القراءة.

source: Description
ar: الوصف

source: Detailed explanation of what this permission allows.
ar: شرح مفصل لما يسمح به هذا الإذن.

source: Admin Permission
ar: إذن المسؤول

source: Admin Permissions
ar: صلاحيات المسؤول

source: Test Attempts Export
ar: تصدير محاولات الاختبار

source: User Data Export
ar: تصدير بيانات المستخدم

source: Requesting User
ar: المستخدم الطالب

source: Job Type
ar: نوع المهمة

source: Status
ar: الحالة

source: File Format
ar: تنسيق الملف

source: Celery Task ID
ar: معرف مهمة Celery

source: The ID of the background task processing this job.
ar: معرف المهمة الخلفية التي تعالج هذه الوظيفة.

source: Applied Filters
ar: الفلاتر المطبقة

source: The query parameters used for this export.
ar: معلمات الاستعلام المستخدمة لهذا التصدير.

source: Exported File
ar: الملف المصدر

source: The final generated file.
ar: الملف النهائي الذي تم إنشاؤه.

source: Error Message
ar: رسالة خطأ

source: Details of the error if the job failed.
ar: تفاصيل الخطأ في حالة فشل الوظيفة.

source: Created At
ar: أنشئت في

source: Completed At
ar: اكتمل في

source: Export Job
ar: مهمة تصدير

source: Export Jobs
ar: مهام التصدير
