Repository: J3ffar/Qader
Catalog: qader_backend/apps/study/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Unnamed Test
ar: اختبار بدون اسم

source: The sequence number of this attempt for this specific test type (e.g., 1st Level Assessment, 3rd Practice Test).
ar: الرقم التسلسلي لهذه المحاولة لهذا النوع المحدد من الاختبار (على سبيل المثال، تقييم المستوى الأول، اختبار الممارسة الثالث).

source: Primary key of the question being answered.
ar: المفتاح الأساسي للسؤال الذي يتم الإجابة عليه.

source: The answer choice selected by the user (A, B, C, or D).
ar: الخيار الذي اختاره المستخدم (أ، ب، ج، أو د).

source: Optional: Time spent on this specific question in seconds.
ar: اختياري: الوقت المستغرق في هذا السؤال المحدد بالثواني.

source: Number of questions answered correctly in this test.
ar: عدد الأسئلة التي تمت الإجابة عليها بشكل صحيح في هذا الاختبار.

source: Points earned from completing the test, streak bonuses, and badges awarded at completion.
ar: النقاط المكتسبة من إكمال الاختبار، مكافآت السلسلة، والشارات الممنوحة عند الانتهاء.

source: Points earned from correctly answering questions during this specific test attempt.
ar: النقاط المكتسبة من الإجابة الصحيحة على الأسئلة خلال محاولة الاختبار هذه.

source: Choose the desired tone for the AI assistant.
ar: اختر النبرة المطلوبة لمساعد الذكاء الاصطناعي.

source: Optional: Link this message to a specific question ID.
ar: اختياري: ربط هذه الرسالة بمعرف سؤال محدد.

source: A transitional or encouraging message from the AI.
ar: رسالة انتقالية أو تشجيعية من الذكاء الاصطناعي.

source: The related test question posed by the AI.
ar: سؤال الاختبار ذو الصلة الذي طرحه الذكاء الاصطناعي.

source: The ID of the question being answered.
ar: معرف السؤال الذي يتم الإجابة عليه.

source: The answer selected by the user (A, B, C, or D).
ar: الإجابة التي اختارها المستخدم (أ، ب، ج، أو د).

source: Feedback generated by the AI on the user's answer.
ar: التعليقات التي تم إنشاؤها بواسطة الذكاء الاصطناعي على إجابة المستخدم.

source: The encouraging message from the AI.
ar: الرسالة التشجيعية من الذكاء الاصطناعي.

source: The question posed by the AI.
ar: السؤال الذي طرحه الذكاء الاصطناعي.

source: Slug of the learning section (e.g., 'verbal').
ar: اسم القسم التعليمي (على سبيل المثال، 'verbal').

source: List of section slugs (e.g., ['verbal', 'quantitative']) to include.
ar: قائمة بأسماء الأقسام (على سبيل المثال، ['verbal', 'quantitative']) لتضمينها.

source: Desired number of questions for the assessment.
ar: العدد المطلوب من الأسئلة للتقييم.

source: Optional name for this custom test configuration.
ar: اسم اختياري لتكوين الاختبار المخصص هذا.

source: Slug of the subsection.
ar: اسم القسم الفرعي.

source: List of subsection slugs to filter questions by.
ar: قائمة بأسماء الأقسام الفرعية لتصفية الأسئلة حسبها.

source: Slug of the active skill.
ar: اسم المهارة النشطة.

source: List of specific active skill slugs to filter questions by.
ar: قائمة بأسماء المهارات النشطة المحددة لتصفية الأسئلة حسبها.

source: Number of questions for the test.
ar: عدد الأسئلة للاختبار.

source: Include only questions starred by the user?
ar: هل تريد تضمين الأسئلة التي وضع عليها المستخدم علامة نجمة فقط؟

source: Include only questions from skills the user hasn't mastered?
ar: هل تريد تضمين الأسئلة من المهارات التي لم يتقنها المستخدم بعد؟

source: Selected skills do not belong to the selected subsections: {}
ar: المهارات المختارة لا تنتمي إلى الأقسام الفرعية المختارة: {}

source: Specify whether this is a 'practice' or 'simulation' test.
ar: حدد ما إذا كان هذا اختبار 'ممارسة' أو 'محاكاة'.

source: Optional: Filter initial questions by these subsection slugs.
ar: اختياري: تصفية الأسئلة الأولية حسب أسماء الأقسام الفرعية هذه.

source: Optional: Filter initial questions by these active skill slugs.
ar: اختياري: تصفية الأسئلة الأولية حسب أسماء المهارات النشطة هذه.

source: Number of questions to fetch initially for the session (can be 0).
ar: عدد الأسئلة التي سيتم جلبها مبدئيًا للجلسة (يمكن أن يكون 0).

source: Filter initial questions to only starred ones?
ar: تصفية الأسئلة الأولية لتضمين الأسئلة المميزة بنجمة فقط؟

source: Filter initial questions to skills not yet mastered?
ar: تصفية الأسئلة الأولية لتضمين المهارات التي لم يتم إتقانها بعد؟

source: The sequence number of this attempt for traditional practice.
ar: الرقم التسلسلي لهذه المحاولة للممارسة التقليدية.

source: The specified test attempt is not currently active or ongoing.
ar: محاولة الاختبار المحددة ليست نشطة حاليًا أو جارية.

source: Test attempt not found.
ar: لم يتم العثور على محاولة الاختبار.

source: An error occurred while retrieving the test attempt.
ar: حدث خطأ أثناء استرداد محاولة الاختبار.

source: An internal error occurred while recording the answer.
ar: حدث خطأ داخلي أثناء تسجيل الإجابة.

source: An internal error occurred while completing the test.
ar: حدث خطأ داخلي أثناء إكمال الاختبار.

source: Test attempt cancelled.
ar: تم إلغاء محاولة الاختبار.

source: An internal error occurred while cancelling the test.
ar: حدث خطأ داخلي أثناء إلغاء الاختبار.

source: Cannot review a test attempt that is not completed.
ar: لا يمكن مراجعة محاولة اختبار لم تكتمل.

source: Completed test attempt not found.
ar: لم يتم العثور على محاولة الاختبار المكتملة.

source: An error occurred while retrieving test attempt details.
ar: حدث خطأ أثناء استرداد تفاصيل محاولة الاختبار.

source: Original test attempt not found or not accessible.
ar: لم يتم العثور على محاولة الاختبار الأصلية أو لا يمكن الوصول إليها.

source: An error occurred while retrieving the original test attempt.
ar: حدث خطأ أثناء استرداد محاولة الاختبار الأصلية.

source: An internal error occurred while trying to retake the test.
ar: حدث خطأ داخلي أثناء محاولة إعادة الاختبار.

source: This conversation session is completed.
ar: تم الانتهاء من جلسة المحادثة هذه.

source: (Note: There was an issue recording this attempt.)
ar: (ملاحظة: حدثت مشكلة في تسجيل هذه المحاولة.)

source: An error occurred while processing your message.
ar: حدث خطأ أثناء معالجة رسالتك.

source: An error occurred while asking for a question.
ar: حدث خطأ أثناء طلب سؤال.

source: No specific topic context found to test. Please discuss a question first.
ar: لم يتم العثور على سياق موضوع محدد للاختبار. يرجى مناقشة سؤال أولاً.

source: Could not generate feedback at this time.
ar: تعذر إنشاء تعليقات في هذا الوقت.

source: An error occurred while submitting your answer.
ar: حدث خطأ أثناء إرسال إجابتك.

source: Session ended successfully.
ar: انتهت الجلسة بنجاح.

source: The study plan for this session is missing or invalid.
ar: خطة الدراسة لهذه الجلسة مفقودة أو غير صالحة.

source: This session has already ended.
ar: انتهت هذه الجلسة بالفعل.

source: Correct! Keep focusing.
ar: صحيح! استمر في التركيز.

source: That was incorrect. Let's review and move on.
ar: كان ذلك غير صحيح. دعنا نراجع وننتقل.

source: An internal error occurred while starting the assessment.
ar: حدث خطأ داخلي أثناء بدء التقييم.

source: An internal error occurred while starting the test.
ar: حدث خطأ داخلي أثناء بدء الاختبار.

source: Invalid start_date format. Use YYYY-MM-DD.
ar: تنسيق start_date غير صالح. استخدم YYYY-MM-DD.

source: Invalid end_date format. Use YYYY-MM-DD.
ar: تنسيق end_date غير صالح. استخدم YYYY-MM-DD.

source: start_date cannot be after end_date.
ar: لا يمكن أن يكون start_date بعد end_date.

source: Invalid aggregation_period. Allowed values are: {', '.join(AGGREGATION_PERIOD_CHOICES)}.
ar: aggregation_period غير صالح. القيم المسموح بها هي: {', '.join(AGGREGATION_PERIOD_CHOICES)}.

source: An unexpected error occurred while generating statistics.
ar: حدث خطأ غير متوقع أثناء إنشاء الإحصائيات.

source: This action is only valid for active traditional practice sessions.
ar: هذا الإجراء صالح فقط لجلسات الممارسة التقليدية النشطة.

source: Active traditional practice session not found.
ar: لم يتم العثور على جلسة ممارسة تقليدية نشطة.

source: An error occurred retrieving the session.
ar: حدث خطأ أثناء استرداد الجلسة.

source: Question not found or is inactive.
ar: لم يتم العثور على السؤال أو أنه غير نشط.

source: An error occurred retrieving the question.
ar: حدث خطأ أثناء استرداد السؤال.

source: An internal error occurred while starting the session.
ar: حدث خطأ داخلي أثناء بدء الجلسة.

source: An error occurred while fetching questions.
ar: حدث خطأ أثناء جلب الأسئلة.

source: Failed to record hint usage or retrieve hint.
ar: فشل في تسجيل استخدام التلميح أو استرداد التلميح.

source: Failed to record elimination usage.
ar: فشل في تسجيل استخدام الاستبعاد.

source: Elimination usage recorded.
ar: تم تسجيل استخدام الاستبعاد.

source: Failed to record action or retrieve answer.
ar: فشل في تسجيل الإجراء أو استرداد الإجابة.

source: Failed to record action or retrieve explanation.
ar: فشل في تسجيل الإجراء أو استرداد الشرح.

source: Study & Progress
ar: الدراسة والتقدم

source: Level Assessment Template
ar: نموذج تقييم المستوى

source: Practice Set
ar: مجموعة تدريب

source: Full Simulation
ar: محاكاة كاملة

source: name
ar: الاسم

source: description
ar: الوصف

source: test definition type
ar: نوع تعريف الاختبار

source: is predefined
ar: محدد مسبقًا

source: If true, this definition uses the specific questions linked below. If false, it acts as a template and relies on 'configuration'.
ar: إذا كانت القيمة صحيحة، يستخدم هذا التعريف الأسئلة المحددة المرتبطة أدناه. إذا كانت القيمة خاطئة، فإنه يعمل كقالب ويعتمد على 'التكوين'.

source: specific questions
ar: أسئلة محددة

source: Specific questions included if 'is_predefined' is true.
ar: الأسئلة المحددة المضمنة إذا كانت 'is_predefined' صحيحة.

source: dynamic configuration template
ar: قالب التكوين الديناميكي

source: JSON defining rules (e.g., {'num_questions_per_skill': {...}, 'total_questions': N}) for dynamically generating tests based on this template if 'is_predefined' is false.
ar: JSON يحدد القواعد (على سبيل المثال، {'num_questions_per_skill': {...}, 'total_questions': N}) لإنشاء اختبارات ديناميكيًا بناءً على هذا القالب إذا كانت 'is_predefined' خاطئة.

source: created at
ar: تاريخ الإنشاء

source: updated at
ar: تاريخ التحديث

source: Configuration must be empty for predefined tests (select Questions instead).
ar: يجب أن يكون التكوين فارغًا للاختبارات المحددة مسبقًا (اختر الأسئلة بدلاً من ذلك).

source: Configuration must be set for dynamic (non-predefined) tests.
ar: يجب تعيين التكوين للاختبارات الديناميكية (غير المحددة مسبقًا).

source: Questions should not be selected for dynamic tests.
ar: لا ينبغي اختيار الأسئلة للاختبارات الديناميكية.

source: Test Definition
ar: تعريف الاختبار

source: Test Definitions
ar: تعريفات الاختبار

source: Started
ar: بدأت

source: Completed
ar: اكتملت

source: Abandoned
ar: مهجورة

source: Error
ar: خطأ

source: Level Assessment
ar: تقييم المستوى

source: Practice Test
ar: اختبار الممارسة

source: Traditional Practice Session
ar: جلسة الممارسة التقليدية

source: user
ar: المستخدم

source: test definition used
ar: تعريف الاختبار المستخدم

source: The Test Definition used for this attempt, if based on one.
ar: تعريف الاختبار المستخدم لهذه المحاولة، إذا كان يعتمد على واحد.

source: attempt type
ar: نوع المحاولة

source: The specific type of this test attempt instance.
ar: النوع المحدد لمثال محاولة الاختبار هذا.

source: test configuration snapshot
ar: لقطة تكوين الاختبار

source: Snapshot of the configuration used to generate this attempt (e.g., sections, skills, num_questions). Ensure consistent structure.
ar: لقطة للتكوين المستخدم لإنشاء هذه المحاولة (على سبيل المثال، الأقسام، المهارات، عدد الأسئلة). تأكد من هيكل متناسق.

source: question IDs
ar: معرفات الأسئلة

source: Ordered list of question primary keys included in this attempt.
ar: قائمة مرتبة بالمفاتيح الأساسية للأسئلة المضمنة في هذه المحاولة.

source: status
ar: الحالة

source: start time
ar: وقت البدء

source: end time
ar: وقت الانتهاء

source: overall score percentage
ar: النسبة المئوية للنتيجة الإجمالية

source: verbal score percentage
ar: النسبة المئوية لنتيجة القسم اللفظي

source: quantitative score percentage
ar: النسبة المئوية لنتيجة القسم الكمي

source: results summary
ar: ملخص النتائج

source: Detailed breakdown, e.g., {"subsection_slug": {"correct": X, "total": Y, "score": Z, "name": "Sub Name"}}
ar: تفصيل مفصل، على سبيل المثال، {"subsection_slug": {"correct": X, "total": Y, "score": Z, "name": "Sub Name"}}

source: completion points awarded
ar: نقاط الإكمال الممنوحة

source: Tracks if gamification points for completing this attempt have been awarded.
ar: يتتبع ما إذا كانت نقاط التلعيب لإكمال هذه المحاولة قد تم منحها.

source: User Test Attempt
ar: محاولة اختبار المستخدم

source: User Test Attempts
ar: محاولات اختبار المستخدم

source: Traditional Learning
ar: التعلم التقليدي

source: Practice Test/Simulation
ar: اختبار الممارسة/المحاكاة

source: Emergency Mode
ar: وضع الطوارئ

source: Learning via Conversation
ar: التعلم عبر المحادثة

source: Challenge
ar: تحدي

source: question
ar: سؤال

source: test attempt session
ar: جلسة محاولة الاختبار

source: conversation session
ar: جلسة المحادثة

source: challenge participation
ar: مشاركة التحدي

source: emergency mode session
ar: جلسة وضع الطوارئ

source: selected answer
ar: الإجابة المختارة

source: is correct
ar: صحيح

source: time taken (seconds)
ar: الوقت المستغرق (بالثواني)

source: Time spent specifically on this question.
ar: الوقت المستغرق خصيصًا في هذا السؤال.

source: used hint
ar: تم استخدام تلميح

source: used elimination
ar: تم استخدام الاستبعاد

source: revealed correct answer
ar: تم الكشف عن الإجابة الصحيحة

source: Track if the user explicitly revealed the correct answer choice.
ar: تتبع ما إذا كان المستخدم قد كشف صراحة عن خيار الإجابة الصحيحة.

source: revealed explanation
ar: تم الكشف عن الشرح

source: Track if the user explicitly revealed the explanation.
ar: تتبع ما إذا كان المستخدم قد كشف صراحة عن الشرح.

source: mode
ar: الوضع

source: The context (feature) in which the question was attempted.
ar: السياق (الميزة) الذي تم فيه محاولة الإجابة على السؤال.

source: attempted at
ar: تمت المحاولة في

source: User Question Attempt
ar: محاولة سؤال المستخدم

source: User Question Attempts
ar: محاولات أسئلة المستخدم

source: Proficiency Score
ar: درجة الكفاءة

source: User mastery score (0.0 to 1.0). Updated after attempts.
ar: درجة إتقان المستخدم (0.0 إلى 1.0). يتم تحديثها بعد المحاولات.

source: Attempts Count
ar: عدد المحاولات

source: Correct Count
ar: عدد الإجابات الصحيحة

source: Last Calculated At
ar: آخر حساب في

source: User Skill Proficiency
ar: كفاءة مهارة المستخدم

source: User Skill Proficiencies
ar: كفاءات مهارات المستخدم

source: reason
ar: السبب

source: suggested plan
ar: الخطة المقترحة

source: Stores plan details: {"focus_skills": ["slug1", ...], "recommended_questions": N, "quick_review_topics": [...]}
ar: يخزن تفاصيل الخطة: {"focus_skills": ["slug1", ...], "recommended_questions": N, "quick_review_topics": [...]}

source: calm mode active
ar: وضع الهدوء نشط

source: Emergency Mode Session
ar: جلسة وضع الطوارئ

source: Emergency Mode Sessions
ar: جلسات وضع الطوارئ

source: Ended
ar: انتهت

source: Active
ar: نشطة

source: Cheerful
ar: مبهج

source: Serious
ar: جدي

source: AI tone
ar: نبرة الذكاء الاصطناعي

source: current topic question
ar: سؤال الموضوع الحالي

source: The question/concept currently being focused on.
ar: السؤال/المفهوم الذي يتم التركيز عليه حاليًا.

source: Conversation Session
ar: جلسة المحادثة

source: Conversation Sessions
ar: جلسات المحادثة

source: User
ar: المستخدم

source: AI
ar: الذكاء الاصطناعي

source: session
ar: الجلسة

source: sender type
ar: نوع المرسل

source: message text
ar: نص الرسالة

source: timestamp
ar: الطابع الزمني

source: related question
ar: سؤال ذو صلة

source: Conversation Message
ar: رسالة المحادثة

source: Conversation Messages
ar: رسائل المحادثة

source: Sorry, the AI assistant is currently unavailable. Please try again later.
ar: عذرًا، مساعد الذكاء الاصطناعي غير متاح حاليًا. يرجى المحاولة مرة أخرى لاحقًا.

source: An unexpected error occurred while generating my response. Please try again.
ar: حدث خطأ غير متوقع أثناء إنشاء ردي. يرجى المحاولة مرة أخرى.

source: I seem to be speechless! Could you try rephrasing?
ar: يبدو أنني عاجز عن الكلام! هل يمكنك محاولة إعادة الصياغة؟

source: I had a little trouble formatting my thoughts. Could you try again?
ar: واجهت مشكلة صغيرة في تنسيق أفكاري. هل يمكنك المحاولة مرة أخرى؟

source: The AI service is currently busy. Please try again in a moment.
ar: عذرًا، مساعد الذكاء الاصطناعي غير متاح حاليًا. يرجى المحاولة مرة أخرى لاحقًا.

source: There's an issue with AI service authentication. Please contact support.
ar: توجد مشكلة في مصادقة خدمة الذكاء الاصطناعي. يرجى الاتصال بالدعم.

source: Could not find a suitable question to ask at this time.
ar: تعذر العثور على سؤال مناسب لطرحه في هذا الوقت.

source: Okay, let's try this practice question:
ar: حسناً، لنجرب هذا السؤال التدريبي:

source: Great! Let's try a related question to solidify your understanding.
ar: رائع! لنجرب سؤالاً ذا صلة لترسيخ فهمك.

source: Sorry, I encountered an issue processing that. Could you try again?
ar: عذرًا، واجهت مشكلة في معالجة ذلك. هل يمكنك المحاولة مرة أخرى؟

source: Answer recorded.
ar: تم تسجيل الإجابة.

source: Answer recorded, but correctness could not be determined for feedback.
ar: تم تسجيل الإجابة، ولكن لم يتم تحديد صحتها للتعليقات.

source: No detailed explanation available.
ar: لا يوجد شرح مفصل متاح.

source: Answer recorded. Correct: {is_correct}.
ar: تم تسجيل الإجابة. صحيح: {is_correct}.

source: Answer recorded. I had a little trouble formatting my detailed feedback this time.
ar: تم تسجيل الإجابة. واجهت مشكلة صغيرة في تنسيق تعليقاتي المفصلة هذه المرة.

source: Test completed! Review your detailed results to identify areas for improvement.
ar: اكتمل الاختبار! راجع نتائجك التفصيلية لتحديد مجالات التحسين.

source: Not enough questions found matching your criteria (found {count}, need at least {min}). Please broaden your filters.
ar: لم يتم العثور على عدد كافٍ من الأسئلة المطابقة لمعاييرك (تم العثور على {count}، تحتاج إلى {min} على الأقل). يرجى توسيع نطاق عوامل التصفية.

source: Authentication required to record an answer.
ar: المصادقة مطلوبة لتسجيل الإجابة.

source: This test attempt is not currently active.
ar: محاولة الاختبار هذه ليست نشطة حاليًا.

source: This question is not part of the current test attempt.
ar: هذا السؤال ليس جزءًا من محاولة الاختبار الحالية.

source: Invalid answer choice provided. Please select A, B, C, or D.
ar: تم تقديم خيار إجابة غير صالح. يرجى اختيار أ، ب، ج، أو د.

source: Answer recorded. See feedback below.
ar: تم تسجيل الإجابة. انظر التعليقات أدناه.

source: Answer recorded. The correct answer is shown below.
ar: تم تسجيل الإجابة. الإجابة الصحيحة معروضة أدناه.

source: No detailed breakdown by topic available.
ar: لا يوجد شرح مفصل متاح.

source: Detailed topic scores are not available for this attempt.
ar: النتائج التفصيلية للمواضيع غير متاحة لهذه المحاولة.

source: No specific answer details available for this attempt.
ar: لا تتوفر تفاصيل إجابة محددة لهذه المحاولة.

source: N/A
ar: غير متوفر

source: Question in '{subsection}' (Skill: {skill}): Your answer '{user_ans}', Correct: '{correct_ans}' (Incorrect).
ar: السؤال في '{subsection}' (المهارة: {skill}): إجابتك '{user_ans}'، الصحيحة: '{correct_ans}' (غير صحيحة).

source: Not Answered
ar: لم يتم الإجابة

source: Question in '{subsection}' (Skill: {skill}): Your answer '{user_ans}' (Correct).
ar: السؤال في '{subsection}' (المهارة: {skill}): إجابتك '{user_ans}' (صحيحة).

source: Could not retrieve specific answer details for analysis.
ar: تعذر استرداد تفاصيل إجابة محددة للتحليل.

source: ... (and {num_more} other questions were answered).
ar: ... (وتمت الإجابة على {num_more} أسئلة أخرى).

source: Excellent work! You demonstrated strong understanding in this test.
ar: عمل ممتاز! لقد أظهرت فهمًا قويًا في هذا الاختبار.

source: Good effort! Keep practicing to improve your score. Review your answers to learn from any mistakes.
ar: جهد جيد! استمر في الممارسة لتحسين درجاتك. راجع إجاباتك للتعلم من أي أخطاء.

source: Please provide a performance analysis for the test I just completed based on my scores and answer summary.
ar: يرجى تقديم تحليل أداء للاختبار الذي أكملته للتو بناءً على درجاتي وملخص الإجابات.

source: Fantastic job on this test! Your hard work is paying off.
ar: عمل رائع في هذا الاختبار! جهدك يؤتي ثماره.

source: Good effort! Your results suggest focusing more practice on '{area}' where your score was {score}%.
ar: جهد جيد! نتائجك تشير إلى ضرورة التركيز على المزيد من الممارسة في '{area}' حيث كانت نتيجتك {score}%.

source: You've completed the test. Take some time to review your answers and identify areas for growth.
ar: لقد أكملت الاختبار. خذ بعض الوقت لمراجعة إجاباتك وتحديد مجالات النمو.

source: Authentication required to complete a test attempt.
ar: المصادقة مطلوبة لإكمال محاولة الاختبار.

source: This test attempt is not active or has already been completed.
ar: محاولة الاختبار هذه ليست نشطة أو تم إكمالها بالفعل.

source: Good effort! Review your results to identify areas for improvement and keep practicing.
ar: جهد جيد! راجع نتائجك لتحديد مجالات التحسين واستمر في الممارسة.

source: Well done on completing the test! Check your detailed results for insights.
ar: أحسنت في إكمال الاختبار! تحقق من نتائجك التفصيلية للحصول على رؤى.

source: Test completed. Scores are not available for detailed analysis at this time.
ar: اكتمل الاختبار. النتائج غير متاحة للتحليل التفصيلي في هذا الوقت.

source: Practice session ended.
ar: انتهت جلسة الممارسة.

source: Practice session ended. You answered {count} questions.
ar: انتهت جلسة الممارسة. لقد أجبت على {count} أسئلة.

source: You already have an active '{attempt_type}' in progress. Please complete or cancel it before starting another of the same type.
ar: لديك بالفعل '{attempt_type}' نشط قيد التقدم. يرجى إكماله أو إلغائه قبل بدء نوع آخر مماثل.

source: Could not verify account limits.
ar: تعذر التحقق من حدود الحساب.

source: Failed to select questions for the test. Please try again later.
ar: فشل في اختيار الأسئلة للاختبار. يرجى المحاولة مرة أخرى لاحقًا.

source: Failed to start the test session.
ar: فشل في بدء جلسة الاختبار.

source: No subsections found for the selected sections.
ar: لم يتم العثور على أقسام فرعية للأقسام المختارة.

source: Original test configuration is missing or invalid.
ar: تكوين الاختبار الأصلي مفقود أو غير صالح.

source: Please complete or cancel your ongoing test before starting a new one.
ar: يرجى إكمال أو إلغاء اختبارك الجاري قبل بدء اختبار جديد.

source: Cannot retake a test that had no questions selected.
ar: لا يمكن إعادة اختبار لم يتم اختيار أي أسئلة فيه.

source: No suitable questions found to generate a similar test based on the original criteria.
ar: لم يتم العثور على أسئلة مناسبة لإنشاء اختبار مشابه بناءً على المعايير الأصلية.

source: Failed to select questions for the new test.
ar: فشل في اختيار الأسئلة للاختبار الجديد.

source: Failed to start the new similar test.
ar: فشل في بدء الاختبار الجديد المشابه.

source: Action not valid for this session.
ar: الإجراء غير صالح لهذه الجلسة.

source: Failed to record action.
ar: فشل في تسجيل الإجراء.

source: Take deep breaths before starting.
ar: خذ أنفاسًا عميقة قبل البدء.

source: Focus on one question at a time.
ar: ركز على سؤال واحد في كل مرة.

source: Read questions carefully.
ar: اقرأ الأسئلة بعناية.

source: Manage your time effectively, but don't rush needlessly.
ar: إدارة وقتك بفعالية، ولكن لا تتسرع بلا داعي.

source: Trust your preparation and stay positive!
ar: ثق في تحضيرك وابقَ إيجابيًا!

source: (General review recommended or user is new)
ar: (مراجعة عامة موصى بها أو المستخدم جديد)

source: Verbal and Quantitative sections
ar: أقسام اللفظي والكمي

source: Please log in to get a personalized plan.
ar: يرجى تسجيل الدخول للحصول على خطة مخصصة.

source: Verbal
ar: لفظي

source: Quantitative
ar: كمي

source: Low score ({score}%)
ar: نتيجة منخفضة ({score}%)

source: Area for improvement ({score}%)
ar: مجال للتحسين ({score}%)

source: Not attempted yet
ar: لم يتم المحاولة بعد
