Repository: J3ffar/Qader
Catalog: qader_backend/apps/study/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Could not generate personalized focus areas due to an error. Focusing on general review.
ar: تعذر إنشاء مجالات تركيز مخصصة بسبب خطأ. التركيز على المراجعة العامة.

source: Remember to stay calm and focused!
ar: تذكر أن تبقى هادئًا ومركزًا!
