Repository: J3ffar/Qader
Catalog: qader_backend/apps/blog/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Blog Management
ar: إدارة المدونة

source: Draft
ar: مسودة

source: Published
ar: منشور

source: Archived
ar: مؤرشف

source: Submitted
ar: تم الإرسال

source: Under Review
ar: قيد المراجعة

source: Answered via Support
ar: تم الرد عبر الدعم

source: Answered via Notification
ar: تم الرد عبر الإشعار

source: Published as Blog Post
ar: تم النشر كمنشور مدونة

source: Closed
ar: مغلق

source: Admin Support Ticket
ar: تذكرة دعم المسؤول

source: Platform Notification
ar: إشعار المنصة

source: Published Blog Post
ar: منشور مدونة منشور

source: Author
ar: المؤلف

source: The staff member who authored this post.
ar: عضو الفريق الذي ألف هذا المنشور.

source: Title
ar: العنوان

source: Slug
ar: سلاغ

source: URL-friendly identifier (auto-generated if left blank).
ar: معرف صديق لعنوان URL (يتم إنشاؤه تلقائيًا إذا ترك فارغًا).

source: Content
ar: المحتوى

source: Main content of the post (supports HTML/Markdown).
ar: المحتوى الرئيسي للمنشور (يدعم HTML/Markdown).

source: Featured Image
ar: صورة مميزة

source: Optional: A featured image for the blog post. Will be shown in listings and at the top of the post.
ar: اختياري: صورة مميزة لمنشور المدونة. ستظهر في القوائم وفي أعلى المنشور.

source: Status
ar: الحالة

source: Published At
ar: تاريخ النشر

source: Tags
ar: الوسوم

source: Comma-separated tags.
ar: وسوم مفصولة بفواصل.

source: Created At
ar: تاريخ الإنشاء

source: Updated At
ar: تاريخ التحديث

source: Blog Post
ar: منشور مدونة

source: Blog Posts
ar: منشورات المدونة

source: Qader Team
ar: فريق قادر

source: User
ar: المستخدم

source: The user requesting advice.
ar: المستخدم الذي يطلب النصيحة.

source: Problem Type/Topic
ar: نوع المشكلة/الموضوع

source: Optional: Type of problem or topic user needs advice on.
ar: اختياري: نوع المشكلة أو الموضوع الذي يحتاج المستخدم نصيحة بشأنه.

source: Description
ar: الوصف

source: Detailed description of the issue/request.
ar: وصف تفصيلي للمشكلة/الطلب.

source: Response Method
ar: طريقة الرد

source: How the user was (or will be) answered.
ar: كيف تم (أو سيتم) الرد على المستخدم.

source: Related Support Ticket
ar: تذكرة دعم ذات صلة

source: Link if this request was answered via a support ticket.
ar: رابط إذا تم الرد على هذا الطلب عبر تذكرة دعم.

source: Related Blog Post
ar: منشور مدونة ذو صلة

source: Link if this request resulted in a published blog post.
ar: رابط إذا أدى هذا الطلب إلى نشر منشور مدونة.

source: Blog Advice Request
ar: طلب نصيحة مدونة

source: Blog Advice Requests
ar: طلبات نصيحة المدونة
