Repository: J3ffar/Qader
Catalog: qader_backend/apps/learning/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Name
ar: الاسم

source: The primary name of the learning section (e.g., Verbal Section).
ar: الاسم الأساسي لقسم التعلم (على سبيل المثال، قسم اللفظي).

source: Slug
ar: الاسم اللطيف (Slug)

source: URL-friendly identifier (leave blank to auto-generate from name).
ar: معرف صديق لعنوان URL (اتركه فارغًا ليتم إنشاؤه تلقائيًا من الاسم).

source: Description
ar: الوصف

source: Optional description of the learning section.
ar: وصف اختياري لقسم التعلم.

source: Order
ar: الترتيب

source: Determines the display order in lists (lower numbers appear first).
ar: يحدد ترتيب العرض في القوائم (الأرقام الأقل تظهر أولاً).

source: Learning Section
ar: قسم التعلم

source: Learning Sections
ar: أقسام التعلم

source: Section
ar: القسم

source: The parent Learning Section this sub-section belongs to.
ar: قسم التعلم الرئيسي الذي ينتمي إليه هذا القسم الفرعي.

source: The name of the sub-section (e.g., Reading Comprehension).
ar: اسم القسم الفرعي (على سبيل المثال، فهم المقروء).

source: URL-friendly identifier (leave blank to auto-generate from section and name).
ar: معرف صديق لعنوان URL (اتركه فارغًا ليتم إنشاؤه تلقائيًا من القسم والاسم).

source: Optional description of the learning sub-section.
ar: وصف اختياري للقسم الفرعي للتعلم.

source: Determines the display order within its parent section (lower numbers first).
ar: يحدد ترتيب العرض داخل القسم الرئيسي (الأرقام الأقل أولاً).

source: Active Status
ar: الحالة النشطة

source: Designates whether this sub-section is active and should be used in question selections, filters, etc.
ar: يحدد ما إذا كان هذا القسم الفرعي نشطًا ويجب استخدامه في اختيارات الأسئلة، عوامل التصفية، إلخ.

source: Learning Sub-Section
ar: قسم فرعي للتعلم

source: Learning Sub-Sections
ar: أقسام فرعية للتعلم

source: Sub-Section
ar: قسم فرعي

source: The parent Learning Sub-Section this skill belongs to.
ar: القسم الفرعي للتعلم الرئيسي الذي تنتمي إليه هذه المهارة.

source: The name of the specific skill (e.g., Solving Linear Equations).
ar: اسم المهارة المحددة (على سبيل المثال، حل المعادلات الخطية).

source: URL-friendly identifier (leave blank to auto-generate from subsection and name).
ar: معرف صديق لعنوان URL (اتركه فارغًا ليتم إنشاؤه تلقائيًا من القسم الفرعي والاسم).

source: Optional description of the skill.
ar: وصف اختياري للمهارة.

source: Designates whether this skill is active and should be used in question selections, filters, etc.
ar: يحدد ما إذا كانت هذه المهارة نشطة ويجب استخدامه في اختيارات الأسئلة، عوامل التصفية، إلخ.

source: Skill
ar: المهارة

source: Skills
ar: المهارات

source: Very Easy
ar: سهل جداً

source: Easy
ar: سهل

source: Medium
ar: متوسط

source: Hard
ar: صعب

source: Very Hard
ar: صعب جداً

source: The primary sub-section this question belongs to.
ar: القسم الفرعي الرئيسي الذي ينتمي إليه هذا السؤال.

source: Primary Skill
ar: المهارة الأساسية

source: The main skill tested by this question (optional).
ar: المهارة الرئيسية التي يختبرها هذا السؤال (اختياري).

source: Question Text
ar: نص السؤال

source: The main text or problem statement of the question.
ar: النص الرئيسي أو بيان المشكلة للسؤال.

source: Option A
ar: الخيار أ

source: Option B
ar: الخيار ب

source: Option C
ar: الخيار ج

source: Option D
ar: الخيار د

source: Correct Answer
ar: الإجابة الصحيحة

source: The letter corresponding to the correct option.
ar: الحرف المقابل للخيار الصحيح.

source: Explanation
ar: الشرح

source: Detailed step-by-step explanation for the solution (supports Markdown/HTML).
ar: شرح تفصيلي خطوة بخطوة للحل (يدعم Markdown/HTML).

source: Hint
ar: تلميح

source: A small hint to guide the student without giving away the answer.
ar: تلميح صغير لتوجيه الطالب دون الكشف عن الإجابة.

source: Solution Method Summary
ar: ملخص طريقة الحل

source: A brief summary of the general strategy or method to solve the question.
ar: ملخص موجز للاستراتيجية العامة أو الطريقة لحل السؤال.

source: Difficulty
ar: الصعوبة

source: Estimated difficulty level of the question.
ar: مستوى الصعوبة المقدر للسؤال.

source: Is Active
ar: نشط

source: Uncheck this to hide the question from students without deleting it.
ar: قم بإلغاء تحديد هذا لإخفاء السؤال عن الطلاب دون حذفه.

source: Starred By Users
ar: مميز بنجمة من قبل المستخدمين

source: Question
ar: سؤال

source: Questions
ar: أسئلة

source: Starred At
ar: تاريخ التمييز بنجمة

source: User Starred Question
ar: سؤال مميز بنجمة من قبل المستخدم

source: User Starred Questions
ar: أسئلة مميزة بنجمة من قبل المستخدمين
