Repository: J3ffar/Qader
Catalog: qader_backend/apps/challenges/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Username of the opponent for a direct challenge. Leave blank for random matchmaking.
ar: اسم مستخدم الخصم لتحدي مباشر. اتركه فارغًا للمطابقة العشوائية.

source: The type of challenge to create.
ar: نوع التحدي المراد إنشاؤه.

source: You cannot challenge yourself.
ar: لا يمكنك تحدي نفسك.

source: Opponent user not found or inactive.
ar: لم يتم العثور على المستخدم المنافس أو أنه غير نشط.

source: An unexpected error occurred while creating the challenge.
ar: حدث خطأ غير متوقع أثناء إنشاء التحدي.

source: The ID of the question being answered.
ar: معرف السؤال الذي يتم الإجابة عليه.

source: The selected answer choice (e.g., 'A', 'B').
ar: خيار الإجابة المحدد (مثال: 'أ', 'ب').

source: This question is not part of the current challenge.
ar: هذا السؤال ليس جزءًا من التحدي الحالي.

source: Invalid answer choice provided.
ar: تم تقديم خيار إجابة غير صالح.

source: Quick Quant (10 Q)
ar: كمي سريع (10 أسئلة)

source: Medium Verbal (15 Q, No Hints)
ar: لفظي متوسط (15 سؤال، بدون تلميحات)

source: Comprehensive (20 Q)
ar: شامل (20 سؤال)

source: Speed Challenge (5 Min)
ar: تحدي السرعة (5 دقائق)

source: Accuracy Challenge
ar: تحدي الدقة

source: Custom
ar: مخصص

source: Pending Invite
ar: دعوة معلقة

source: Pending Matchmaking
ar: مطابقة معلقة

source: Accepted / Waiting Start
ar: مقبول / بانتظار البدء

source: Ongoing
ar: قيد التقدم

source: Completed
ar: مكتمل

source: Declined
ar: مرفوض

source: Cancelled
ar: ملغى

source: Expired
ar: منتهي الصلاحية

source: Challenger
ar: المتحدي

source: Opponent
ar: المنافس

source: challenge type
ar: نوع التحدي

source: Identifier for the predefined type of challenge.
ar: معرف لنوع التحدي المحدد مسبقًا.

source: status
ar: الحالة

source: challenge configuration
ar: تكوين التحدي

source: Specific parameters for this challenge instance.
ar: معلمات محددة لنسخة التحدي هذه.

source: question IDs
ar: معرفات الأسئلة

source: Ordered list of question IDs included in this challenge.
ar: قائمة مرتبة بمعرفات الأسئلة المتضمنة في هذا التحدي.

source: Winner
ar: الفائز

source: accepted at
ar: تاريخ القبول

source: started at
ar: تاريخ البدء

source: completed at
ar: تاريخ الانتهاء

source: Challenger Points Awarded
ar: النقاط الممنوحة للمتحدي

source: Opponent Points Awarded
ar: النقاط الممنوحة للمنافس

source: Challenge
ar: التحدي

source: Challenges
ar: التحديات

source: Random/Pending
ar: عشوائي/معلق

source: Challenger and opponent cannot be the same person.
ar: لا يمكن أن يكون المتحدي والخصم نفس الشخص.

source: User
ar: المستخدم

source: score
ar: النتيجة

source: is ready
ar: جاهز

source: Indicates if the user is ready to start.
ar: يشير إلى ما إذا كان المستخدم جاهزًا للبدء.

source: user start time
ar: وقت بدء المستخدم

source: user end time
ar: وقت انتهاء المستخدم

source: Question Attempts
ar: محاولات الأسئلة في هذا التحدي

source: Challenge Attempt
ar: محاولة التحدي

source: Challenge Attempts
ar: محاولات التحدي

source: A fast-paced challenge focusing on 10 quantitative questions.
ar: تحدي سريع يركز على 10 أسئلة كمية.

source: Test your verbal skills with 15 questions and no hints allowed.
ar: اختبر مهاراتك اللفظية بـ 15 سؤالًا وبدون تلميحات مسموح بها.

source: A balanced test of 20 questions from both quantitative and verbal sections.
ar: اختبار متوازن من 20 سؤالًا من الأقسام الكمية واللفظية.

source: Solve as many questions as you can in 5 minutes. Speed is key!
ar: حل أكبر عدد ممكن من الأسئلة في 5 دقائق. السرعة هي المفتاح!

source: Focus on precision. Answer 15 questions with no time pressure. Highest accuracy wins.
ar: ركز على الدقة. أجب على 15 سؤالًا بدون ضغط وقت. أعلى دقة تفوز.

source: No suitable questions found for this challenge configuration.
ar: لم يتم العثور على أسئلة مناسبة لتكوين التحدي هذا.

source: Invalid challenger user.
ar: مستخدم المتحدي غير صالح.

source: Invalid opponent user specified.
ar: تم تحديد مستخدم منافس غير صالح.

source: Invalid challenge type specified.
ar: تم تحديد نوع تحدي غير صالح.

source: Could not find suitable questions for this challenge type.
ar: تعذر العثور على أسئلة مناسبة لنوع التحدي هذا.

source: Random challenge started with {username}!
ar: بدأ تحدي عشوائي مع {username}!

source: Searching for a random opponent...
ar: البحث عن منافس عشوائي...

source: Challenge issued to {username}!
ar: تم إصدار تحدي لـ {username}!

source: You are not the invited opponent.
ar: أنت لست المنافس المدعو.

source: Challenge is not pending invitation.
ar: التحدي ليس بانتظار الدعوة.

source: Only the challenger can cancel.
ar: المتحدي فقط يمكنه الإلغاء.

source: Challenge cannot be cancelled in its current state.
ar: لا يمكن إلغاء التحدي في حالته الحالية.

source: You are not a participant in this challenge.
ar: أنت لست مشاركًا في هذا التحدي.

source: Challenge is not in a state to mark ready.
ar: التحدي ليس في حالة تسمح بتحديد الجاهزية.

source: Cannot start challenge without an opponent.
ar: لا يمكن بدء التحدي بدون منافس.

source: Challenge is not ongoing.
ar: التحدي ليس قيد التقدم.

source: Invalid question for this challenge.
ar: سؤال غير صالح لهذا التحدي.

source: Question not found.
ar: لم يتم العثور على السؤال.

source: Challenge participation record not found.
ar: لم يتم العثور على سجل مشاركة التحدي.

source: You have already answered this question in this challenge.
ar: لقد أجبت بالفعل على هذا السؤال في هذا التحدي.

source: Tie/Completed
ar: تعادل/مكتمل

source: Win
ar: فوز

source: Loss
ar: خسارة

source: Challenge #{cid} vs {opp} - Result: {res}
ar: التحدي رقم {cid} ضد {opp} - النتيجة: {res}

source: Can only rematch completed challenges.
ar: يمكن إعادة تحدي التحديات المكتملة فقط.

source: You were not a participant in the original challenge.
ar: لم تكن مشاركًا في التحدي الأصلي.

source: Cannot rematch a challenge that didn't have two participants.
ar: لا يمكن إعادة تحدي لم يكن فيه مشاركان.

source: Cannot rematch this challenge (missing opponent).
ar: لا يمكن إعادة تحدي هذا التحدي (المنافس مفقود).
